function 중간과제완성() {
    let 가계부 = [
        ['날짜','항목','금액'],
        ['2024-11-27','콜라','1000'],
        ['2024-11-27','커피','1200'],
        ['2024-11-27','피자','9000'],
        ['2024-11-27','황금올리브치킨','20000'],
        ['2024-11-27','족발','30000'],
        ['2024-11-27','방어회','25000']        
    ]

    html = "<table>"
    for (let i = 0; i < 가계부.length; i++) {
        html += "<tr>"
        for (let j = 0; j < 가계부[i].length; j++) {
            html += `<td>${가계부[i][j]}</td>`
        }
        html += "</tr>"
    }
    html += "</table>"

    document.querySelector('body').innerHTML = html
}

중간과제완성()